---
kind: method
id: M:Autodesk.Revit.DB.PhaseArray.Insert(Autodesk.Revit.DB.Phase,System.Int32)
source: html/ae967d4f-e3e4-46c7-ec0c-51039e53beaf.htm
---
# Autodesk.Revit.DB.PhaseArray.Insert Method

Insert the specified phase into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	Phase item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Phase`) - The phase to be inserted into the array.
- **index** (`System.Int32`) - The phase will be inserted before this index.

## Returns
Returns whether the phase was inserted into the array.